/*
*=========================================================================================
*  Подключаем библиотеки
* */
import express from "express";
import Sequelize from "sequelize";
import handlebars from "express-handlebars";
const urlencodedParser = express.urlencoded({extended: false});
// ****** Подключаем роуты *************
import router from "./routes/router.js";

/*
*  Конец
* ========================================================================================
* */



/*
* ==========================================================================================
*
*  Настраиваем Sequelize
* */
// Определяем объект Sequelize
const sequelize = new Sequelize("askue", "root", "28162342", {
    dialect: "mysql",
    host: "localhost",
    port: "3306",
    define: {
        timestamps: false
    }
});





/*
*  Конец
* =============================================================================================
* */




/*
* ==========================================================================================
*
*  Настраиваем Express
* */

const app = express();
app.use(express.json());

(async () => {
    await sequelize.sync().then( () => [
        app.listen(3000, function () {
            console.log("Сервер ожидает подключения...");
        })
    ]).catch( (err) => {
        console.log(err)
    })
})();

// ***********  Здесь роуты
// Обрабатываем главную
app.use('/', router);




/*
*  Конец
* =============================================================================================
* */


/*
* ==========================================================================================
*
*  Настраиваем Handlebars
* */
app.engine('handlebars', handlebars.engine());
app.set('view engine', 'handlebars');
app.set('views', './views');

/*
*  Конец
* =============================================================================================
* */


